# класс для разбора подпрограмм для создания циклограмм
# циклограмма согласно данному шаблону
# ["Name", [[Address, Subaddress, Wr/R, [Data], Data leng, Start time, Finish time, Interval, Delay], [...], [...]]]
#    |          |          |        |      |         |          |           |          |         |
#    |          |          |        |      |         |          |           |          |         -- Задержка отправки
#    |          |          |        |      |         |          |           |          --- Интервал отправки, c
#    |          |          |        |      |         |          |           - Время остановки посылок, c
#    |          |          |        |      |         |          --- Время старта отправки от запуска программы, c
#    |          |          |        |      |         --- Длина данных для приема/отправки
#    |          |          |        |      ------------- Данные для отправки (при приеме не имеет значения)
#    |          |          |        -------------------- Отправка - "0", Прием - "1"
#    |          |          ----------------------------- Подадрес
#    |          ---------------------------------------- Адрес ОУ
#    --------------------------------------------------- Имя циклограммы

from datetime import datetime, timedelta

def get_s_from_2000_like_u16_list() -> list:
    # input datetime
    dt: datetime = datetime.now()
    # epoch time
    epoch_time = datetime(2000, 1, 1)
    # subtract Datetime from epoch datetime
    delta: timedelta = (dt - epoch_time)
    return [(int(delta.total_seconds()) >> 16) & 0xFFFF, (int(delta.total_seconds()) >> 0) & 0xFFFF]

def form_cg_bakv_CHP4() -> list:
    test_bakv_CHP4: list = ["ЦГ для диагностики", [
        # Инициализация КВВ
        [29, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 5, 5, 0.0, 0.0],
        # Синхронизация времени
        # input datetime
        [29, 17, 0, [0x0001] + get_s_from_2000_like_u16_list() + [0x0000], 4, 20, 20, 0.0, 0.0],
        # Установка измерительного интервала 120 с. 
        [29, 17, 0, [0x0003, 0x0001, 0x0078, 0x0000], 4, 20, 20, 0.0, 0.2],
        # Системный кадр каждые 250 мс на протяжении всего опроса. В случае опроса с БИВК предлагается
        # Останавливать за 200 мс до выдачи любой команды на любой подадрес. Начинать через 200 мс после выдачи команд
        [29, 1, 1, [0], 32, 20, 510, 0.25, 0.5],
        # Кадры ДВ с фоновым шумом каждые 60 каждые 200 мс
        [29, 2, 1, [], 32, 25, 510, 60.0, 0.0],
        [29, 2, 1, [], 32, 25, 510, 60.0, 0.2],
        [29, 2, 1, [], 32, 25, 510, 60.0, 0.4],
        [29, 3, 1, [], 32, 25, 510, 60.0, 0.6],
        [29, 3, 1, [], 32, 25, 510, 60.0, 0.8],
        [29, 3, 1, [], 32, 25, 510, 60.0, 1.0],
        [29, 4, 1, [], 32, 25, 510, 60.0, 1.2],
        [29, 4, 1, [], 32, 25, 510, 60.0, 1.4],
        [29, 4, 1, [], 32, 25, 510, 60.0, 1.6],
        [29, 5, 1, [], 32, 25, 510, 60.0, 1.8],
        [29, 5, 1, [], 32, 25, 510, 60.0, 2.0],
        [29, 5, 1, [], 32, 25, 510, 60.0, 2.2],

        # Включение режима контроля
        [29, 17, 0, [0x0005, 0x0001, 0x0000, 0x0000], 4, 30, 30, 0.0, 0.0],
        # Ждем 1 измеритель интервал
        # Включение воздействия на всех ДВ: период 220 мкс (1 с), количество 5
        [29, 17, 0, [0x000C, 0x0000, 0x250, 0x10], 4, 150, 150, 0.0, 0.0],
        [29, 17, 0, [0x000C, 0x0001, 0x250, 0x10], 4, 150, 150, 0.0, 0.3],
        [29, 17, 0, [0x000C, 0x0002, 0x250, 0x10], 4, 150, 150, 0.0, 0.6],
        [29, 17, 0, [0x000C, 0x0003, 0x250, 0x10], 4, 150, 150, 0.0, 0.9],
        # Через 20 после подачи воздействий сбрасываем флаги событий
        [29, 17, 0, [0x0006, 0x0000, 0x0000, 0x0000], 4, 170, 170, 0.0, 0.0],
        # Через 30 после подачи воздействий отключаем режим контроля
        [29, 17, 0, [0x0005, 0x0000, 0x0000, 0x0000], 4, 180, 180, 0.0, 0.0],

        # Чтение ЗУ ЦМ
        [29, 18, 0, [0xABBA, 0xACDC, 0x0000, 0x0000], 4, 185, 200, 0.25, 0.0],
        # Задержка 200 мс
        [29, 20, 1, [0], 32, 185, 200, 0.25, 0.2],

        # Отключение всех ДВ с задежкой 250 мс
        [29, 17, 0, [0x0009, 0x0000, 0x0000, 0x0000], 4, 200, 200, 0.0, 0.0],
        [29, 17, 0, [0x0009, 0x0001, 0x0000, 0x0000], 4, 200, 200, 0.0, 0.25],
        [29, 17, 0, [0x0009, 0x0002, 0x0000, 0x0000], 4, 200, 200, 0.0, 0.5],
        [29, 17, 0, [0x0009, 0x0003, 0x0000, 0x0000], 4, 200, 200, 0.0, 0.75],

        # Включение всех ДВ через 1 секунду после отключения
        [29, 17, 0, [0x0009, 0x0000, 0x0001, 0x0000], 4, 201, 201, 0.0, 0.0],
        [29, 17, 0, [0x0009, 0x0001, 0x0001, 0x0000], 4, 201, 201, 0.0, 0.25],
        [29, 17, 0, [0x0009, 0x0002, 0x0001, 0x0000], 4, 201, 201, 0.0, 0.5],
        [29, 17, 0, [0x0009, 0x0003, 0x0001, 0x0000], 4, 201, 201, 0.0, 0.75],

        # Включение режима контроля через 1 измерительный интервал после включения ДВ, чтобы убедиться что все ДВ включены в опрос
        [29, 17, 0, [0x0005, 0x0001, 0x0000, 0x0000], 4, 330, 330, 0.0, 0.0],
        # Ждем 1 измеритель интервал
        # Включение воздействия на всех ДВ: период 220 мкс (1 с), количество 5
        [29, 17, 0, [0x000C, 0x0000, 0x250, 0x10], 4, 450, 450, 0.0, 0.0],
        [29, 17, 0, [0x000C, 0x0001, 0x250, 0x10], 4, 450, 450, 0.0, 0.3],
        [29, 17, 0, [0x000C, 0x0002, 0x250, 0x10], 4, 450, 450, 0.0, 0.6],
        [29, 17, 0, [0x000C, 0x0003, 0x250, 0x10], 4, 450, 450, 0.0, 0.9],
        # Через 20 после подачи воздействий сбрасываем флаги событий
        [29, 17, 0, [0x0006, 0x0000, 0x0000, 0x0000], 4, 470, 470, 0.0, 0.0],
        # Через 30 после подачи воздействий отключаем режим контроля
        [29, 17, 0, [0x0005, 0x0000, 0x0000, 0x0000], 4, 480, 480, 0.0, 0.0],

        # Чтение ЗУ ЦМ
        [29, 18, 0, [0xABBA, 0xACDC, 0x0000, 0x0000], 4, 485, 500, 0.25, 0.0],
        # Задержка 200 мс
        [29, 20, 1, [0], 32, 485, 500, 0.25, 0.2]
    ]]
    return test_bakv_CHP4

def form_cg_bakv_CHP4_with_dv1_2_lvl() -> list:
    test_bakv_CHP4: list = ["ЦГ для диагностики с установкой порогов ДВ1-2", [
        # Инициализация КВВ
        [29, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 5, 5, 0.0, 0.0],
        # Синхронизация времени
        # input datetime
        [29, 17, 0, [0x0001] + get_s_from_2000_like_u16_list() + [0x0000], 4, 20, 20, 0.0, 0.0],
        # Установка измерительного интервала 120 с. 
        [29, 17, 0, [0x0003, 0x0001, 0x0078, 0x0000], 4, 20, 20, 0.0, 0.2],
        # Системный кадр каждые 250 мс на протяжении всего опроса. В случае опроса с БИВК предлагается
        # Останавливать за 200 мс до выдачи любой команды на любой подадрес. Начинать через 200 мс после выдачи команд
        [29, 1, 1, [0], 32, 20, 510, 0.25, 0.5],
        # Кадры ДВ с фоновым шумом каждые 60 каждые 200 мс
        [29, 2, 1, [], 32, 25, 510, 60.0, 0.0],
        [29, 2, 1, [], 32, 25, 510, 60.0, 0.2],
        [29, 2, 1, [], 32, 25, 510, 60.0, 0.4],
        [29, 3, 1, [], 32, 25, 510, 60.0, 0.6],
        [29, 3, 1, [], 32, 25, 510, 60.0, 0.8],
        [29, 3, 1, [], 32, 25, 510, 60.0, 1.0],
        [29, 4, 1, [], 32, 25, 510, 60.0, 1.2],
        [29, 4, 1, [], 32, 25, 510, 60.0, 1.4],
        [29, 4, 1, [], 32, 25, 510, 60.0, 1.6],
        [29, 5, 1, [], 32, 25, 510, 60.0, 1.8],
        [29, 5, 1, [], 32, 25, 510, 60.0, 2.0],
        [29, 5, 1, [], 32, 25, 510, 60.0, 2.2],

        # Включение режима контроля
        [29, 17, 0, [0x0005, 0x0001, 0x0000, 0x0000], 4, 30, 30, 0.0, 0.0],
        # Ждем 1 измеритель интервал
        # Включение воздействия на всех ДВ: период 220 мкс (1 с), количество 5
        [29, 17, 0, [0x000C, 0x0000, 0x250, 0x10], 4, 150, 150, 0.0, 0.0],
        [29, 17, 0, [0x000C, 0x0001, 0x250, 0x10], 4, 150, 150, 0.0, 0.3],
        [29, 17, 0, [0x000C, 0x0002, 0x250, 0x10], 4, 150, 150, 0.0, 0.6],
        [29, 17, 0, [0x000C, 0x0003, 0x250, 0x10], 4, 150, 150, 0.0, 0.9],

        # Чтение ЗУ ЦМ
        [29, 18, 0, [0xABBA, 0xACDC, 0x0000, 0x0000], 4, 165, 180, 0.25, 0.0],
        # Задержка 200 мс
        [29, 20, 1, [0], 32, 165, 180, 0.25, 0.2],
        
        # Через 20 после подачи воздействий сбрасываем флаги событий
        [29, 17, 0, [0x0006, 0x0000, 0x0000, 0x0000], 4, 185, 185, 0.0, 0.0],
        # Через 30 после подачи воздействий отключаем режим контроля
        [29, 17, 0, [0x0005, 0x0000, 0x0000, 0x0000], 4, 190, 190, 0.0, 0.0],

        # Переключение всех ДВ с задежкой 250 мс
        [29, 17, 0, [0x0009, 0x0100, 0x0001, 0x0000], 4, 200, 200, 0.0, 0.0],
        [29, 17, 0, [0x0009, 0x0101, 0x0001, 0x0000], 4, 200, 200, 0.0, 0.25],
        [29, 17, 0, [0x0009, 0x0102, 0x0001, 0x0000], 4, 200, 200, 0.0, 0.5],
        [29, 17, 0, [0x0009, 0x0103, 0x0001, 0x0000], 4, 200, 200, 0.0, 0.75],

        # Уставки для ДВ 1 Ось Х
        [29, 17, 0, [0x0010, 0x0000, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 0.0],
        [29, 17, 0, [0x0010, 0x0100, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 0.25],
        [29, 17, 0, [0x0010, 0x0200, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 0.5],
        [29, 17, 0, [0x0010, 0x0300, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 0.75],
        [29, 17, 0, [0x0010, 0x0400, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 1.0],
        [29, 17, 0, [0x0010, 0x0500, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 1.25],
        [29, 17, 0, [0x0010, 0x0600, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 1.5],
        [29, 17, 0, [0x0010, 0x0700, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 1.75],
        [29, 17, 0, [0x0010, 0x0800, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 2.0],
        [29, 17, 0, [0x0010, 0x0900, 0x6FFF, 0xFFA0], 4, 201, 204, 0.0, 2.25],

             # Уставки для ДВ 1 Ось Y
        [29, 17, 0, [0x0011, 0x0000, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 0.0],
        [29, 17, 0, [0x0011, 0x0100, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 0.25],
        [29, 17, 0, [0x0011, 0x0200, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 0.5],
        [29, 17, 0, [0x0011, 0x0300, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 0.75],
        [29, 17, 0, [0x0011, 0x0400, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 1.0],
        [29, 17, 0, [0x0011, 0x0500, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 1.25],
        [29, 17, 0, [0x0011, 0x0600, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 1.5],
        [29, 17, 0, [0x0011, 0x0700, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 1.75],
        [29, 17, 0, [0x0011, 0x0800, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 2.0],
        [29, 17, 0, [0x0011, 0x0900, 0x6FFF, 0xFFA0], 4, 204, 207, 0.0, 2.25],

             # Уставки для ДВ 1 Ось Z
        [29, 17, 0, [0x0012, 0x0000, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 0.0],
        [29, 17, 0, [0x0012, 0x0100, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 0.25],
        [29, 17, 0, [0x0012, 0x0200, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 0.5],
        [29, 17, 0, [0x0012, 0x0300, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 0.75],
        [29, 17, 0, [0x0012, 0x0400, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 1.0],
        [29, 17, 0, [0x0012, 0x0500, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 1.25],
        [29, 17, 0, [0x0012, 0x0600, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 1.5],
        [29, 17, 0, [0x0012, 0x0700, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 1.75],
        [29, 17, 0, [0x0012, 0x0800, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 2.0],
        [29, 17, 0, [0x0012, 0x0900, 0x6FFF, 0xFFA0], 4, 207, 210, 0.0, 2.25],

            # Уставки для ДВ 2 Ось Х
        [29, 17, 0, [0x0010, 0x0001, 0x0000, 0x0020], 4, 210, 213, 0.0, 0.0],
        [29, 17, 0, [0x0010, 0x0101, 0x0000, 0x0020], 4, 210, 213, 0.0, 0.25],
        [29, 17, 0, [0x0010, 0x0201, 0x0000, 0x0020], 4, 210, 213, 0.0, 0.5],
        [29, 17, 0, [0x0010, 0x0301, 0x0000, 0x0020], 4, 210, 213, 0.0, 0.75],
        [29, 17, 0, [0x0010, 0x0401, 0x0000, 0x0020], 4, 210, 213, 0.0, 1.0],
        [29, 17, 0, [0x0010, 0x0501, 0x0000, 0x0020], 4, 210, 213, 0.0, 1.25],
        [29, 17, 0, [0x0010, 0x0601, 0x0000, 0x0020], 4, 210, 213, 0.0, 1.5],
        [29, 17, 0, [0x0010, 0x0701, 0x0000, 0x0020], 4, 210, 213, 0.0, 1.75],
        [29, 17, 0, [0x0010, 0x0801, 0x0000, 0x0020], 4, 210, 213, 0.0, 2.0],
        [29, 17, 0, [0x0010, 0x0901, 0x0000, 0x0020], 4, 210, 213, 0.0, 2.25],

             # Уставки для ДВ 2 Ось Y
        [29, 17, 0, [0x0011, 0x0001, 0x0000, 0x0020], 4, 213, 216, 0.0, 0.0],
        [29, 17, 0, [0x0011, 0x0101, 0x0000, 0x0020], 4, 213, 216, 0.0, 0.25],
        [29, 17, 0, [0x0011, 0x0201, 0x0000, 0x0020], 4, 213, 216, 0.0, 0.5],
        [29, 17, 0, [0x0011, 0x0301, 0x0000, 0x0020], 4, 213, 216, 0.0, 0.75],
        [29, 17, 0, [0x0011, 0x0401, 0x0000, 0x0020], 4, 213, 216, 0.0, 1.0],
        [29, 17, 0, [0x0011, 0x0501, 0x0000, 0x0020], 4, 213, 216, 0.0, 1.25],
        [29, 17, 0, [0x0011, 0x0601, 0x0000, 0x0020], 4, 213, 216, 0.0, 1.5],
        [29, 17, 0, [0x0011, 0x0701, 0x0000, 0x0020], 4, 213, 216, 0.0, 1.75],
        [29, 17, 0, [0x0011, 0x0801, 0x0000, 0x0020], 4, 213, 216, 0.0, 2.0],
        [29, 17, 0, [0x0011, 0x0901, 0x0000, 0x0020], 4, 213, 216, 0.0, 2.25],

             # Уставки для ДВ 2 Ось Z
        [29, 17, 0, [0x0012, 0x0001, 0x0000, 0x0020], 4, 216, 219, 0.0, 0.0],
        [29, 17, 0, [0x0012, 0x0101, 0x0000, 0x0020], 4, 216, 219, 0.0, 0.25],
        [29, 17, 0, [0x0012, 0x0201, 0x0000, 0x0020], 4, 216, 219, 0.0, 0.5],
        [29, 17, 0, [0x0012, 0x0301, 0x0000, 0x0020], 4, 216, 219, 0.0, 0.75],
        [29, 17, 0, [0x0012, 0x0401, 0x0000, 0x0020], 4, 216, 219, 0.0, 1.0],
        [29, 17, 0, [0x0012, 0x0501, 0x0000, 0x0020], 4, 216, 219, 0.0, 1.25],
        [29, 17, 0, [0x0012, 0x0601, 0x0000, 0x0020], 4, 216, 219, 0.0, 1.5],
        [29, 17, 0, [0x0012, 0x0701, 0x0000, 0x0020], 4, 216, 219, 0.0, 1.75],
        [29, 17, 0, [0x0012, 0x0801, 0x0000, 0x0020], 4, 216, 219, 0.0, 2.0],
        [29, 17, 0, [0x0012, 0x0901, 0x0000, 0x0020], 4, 216, 219, 0.0, 2.25],

        # Включение режима контроля через 1 измерительный интервал после включения ДВ, чтобы убедиться что все ДВ включены в опрос
        [29, 17, 0, [0x0005, 0x0001, 0x0000, 0x0000], 4, 330, 330, 0.0, 0.0],
        # Ждем 1 измеритель интервал
        # Включение воздействия на всех ДВ: период 220 мкс (1 с), количество 5
        [29, 17, 0, [0x000C, 0x0000, 0x250, 0x10], 4, 450, 450, 0.0, 0.0],
        [29, 17, 0, [0x000C, 0x0001, 0x250, 0x10], 4, 450, 450, 0.0, 0.3],
        [29, 17, 0, [0x000C, 0x0002, 0x250, 0x10], 4, 450, 450, 0.0, 0.6],
        [29, 17, 0, [0x000C, 0x0003, 0x250, 0x10], 4, 450, 450, 0.0, 0.9],
        
        # Чтение ЗУ ЦМ
        [29, 18, 0, [0xABBA, 0xACDC, 0x0000, 0x0000], 4, 465, 480, 0.25, 0.0],
        # Задержка 200 мс
        [29, 20, 1, [0], 32, 465, 480, 0.25, 0.2],
        
        # Через 20 после подачи воздействий сбрасываем флаги событий
        [29, 17, 0, [0x0006, 0x0000, 0x0000, 0x0000], 4, 485, 485, 0.0, 0.0],
        # Через 30 после подачи воздействий отключаем режим контроля
        [29, 17, 0, [0x0005, 0x0000, 0x0000, 0x0000], 4, 490, 490, 0.0, 0.0],
    ]]
    return test_bakv_CHP4



