# класс для разбора подпрограмм для создания циклограмм
# циклограмма согласно данному шаблону
# ["Name", [[Address, Subaddress, Wr/R, [Data], Data leng, Start time, Finish time, Interval, Delay], [...], [...]]]
#    |          |          |        |      |         |          |           |          |         |
#    |          |          |        |      |         |          |           |          |         -- Задержка отправки
#    |          |          |        |      |         |          |           |          --- Интервал отправки, c
#    |          |          |        |      |         |          |           - Время остановки посылок, c
#    |          |          |        |      |         |          --- Время старта отправки от запуска программы, c
#    |          |          |        |      |         --- Длина данных для приема/отправки
#    |          |          |        |      ------------- Данные для отправки (при приеме не имеет значения)
#    |          |          |        -------------------- Отправка - "0", Прием - "1"
#    |          |          ----------------------------- Подадрес
#    |          ---------------------------------------- Адрес ОУ
#    --------------------------------------------------- Имя циклограммы

fast_test = ["Быстрый тест ЭККД", [
    # Инициализация КВВ
    [19, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
    # Установка времени
    [19, 17, 0, [0x0001, 0x0000, 0x0000, 0x003C], 4, 0, 0, 0.0, 15.0],
    # Установка интервалов генерации кадров
    [19, 17, 0, [0x0003, 0x0000, 0x000A, 0x0000], 4, 15, 15, 0.0, 0.0],
    # Чтение оперативных данных
    [19, 1, 1, [], 32, 16, 300, 5.0, 0.0],
    [19, 2, 1, [], 32, 16, 300, 5.0, 0.1],
    # Чтение ЗУ ЦМ
    [19, 18, 0, [0xABBA, 0xACDC, 0x0000, 0x0000], 4, 300, 600, 0.2, 0.0],
    [19, 20, 1, [0], 32, 300, 600, 0.2, 0.1],
]]
