# класс для разбора подпрограмм для создания циклограмм
# циклограмма согласно данному шаблону
# ["Name", [[Address, Subaddress, Wr/R, [Data], Data leng, Start time, Finish time, Interval, Delay], [...], [...]]]
#    |          |          |        |      |         |          |           |          |         |
#    |          |          |        |      |         |          |           |          |         -- Задержка отправки
#    |          |          |        |      |         |          |           |          --- Интервал отправки, c
#    |          |          |        |      |         |          |           - Время остановки посылок, c
#    |          |          |        |      |         |          --- Время старта отправки от запуска программы, c
#    |          |          |        |      |         --- Длина данных для приема/отправки
#    |          |          |        |      ------------- Данные для отправки (при приеме не имеет значения)
#    |          |          |        -------------------- Отправка - "0", Прием - "1"
#    |          |          ----------------------------- Подадрес
#    |          ---------------------------------------- Адрес ОУ
#    --------------------------------------------------- Имя циклограммы

input_test_with_reading_repetition = ["входной контроль МБКАП по МКО с повторным чтением", [
    # Инициализация МБКАП
    [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
    # Установка интервала системного кадра
    [22, 17, 0, [0x0003, 0x0001, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.1],
    # Установка измерительного интервала МПП27, МПП100, ДНТ 20 сек
    [22, 17, 0, [0x0003, 0x0000, 0x0014, 0x0000], 4, 15, 15, 0.0, 0.0],
    # Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 921, 985, 0.5, 0.0],
    [22, 14, 1, [0], 32, 921, 985, 0.5, 0.1],
    # Установка указателя чтения в 0
    [22, 17, 0, [0x0004, 0x0000, 0x0000, 0x0000], 4, 990, 990, 0.0, 0.0],
    # Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1000, 1064, 0.5, 0.0],
    [22, 14, 1, [0], 32, 1000, 1064, 0.5, 0.1],
]]

dir_test = ["тестирование ДИР МБКАП", [
    # Инициализация МБКАП
    [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
    # Установка интервала генерации системного кадра
    [22, 17, 0, [0x000D, 0x0000, 0x0000, 0x0000], 4, 10, 3610, 30.0, 0.0],
    [22, 17, 0, [0x000D, 0x0001, 0x0000, 0x0000], 4, 10, 3610, 30.0, 10.0],
    [22, 17, 0, [0x000D, 0x0002, 0x0000, 0x0000], 4, 10, 3610, 30.0, 20.0],
    # Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 20, 3610, 1, 0.5],
    [22, 14, 1, [0], 32, 20, 3610, 1, 0.6],
]]

input_test = ["входной контроль МБКАП по МКО ", [
    # Инициализация МБКАП
    [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
    # Установка интервала генерации системного кадра
    [22, 17, 0, [0x0003, 0x0001, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.1],
    # Установка измерительного интервала МПП27, МПП100, ДНТ 20 сек
    [22, 17, 0, [0x0003, 0x0000, 0x0014, 0x0000], 4, 15, 15, 0.0, 0.0],
    # Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 900, 1000, 0.5, 0.0],
    [22, 14, 1, [0], 32, 900, 1000, 0.5, 0.1],
]]

all_day_test = ["суточный прогон МБКАП по МКО ", [
    # Инициализация МБКАП
    [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
    #1 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1440, 86400, 1440, 0.0],
    [22, 14, 1, [0], 32, 1440, 86400, 1440, 0.1],
    # 2 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1441, 86401, 1440, 0.0],
    [22, 14, 1, [0], 32, 1441, 86401, 1440, 0.1],
    # 3 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1442, 86402, 1440, 0.0],
    [22, 14, 1, [0], 32, 1442, 86402, 1440, 0.1],
    # 4 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1443, 86403, 1440, 0.0],
    [22, 14, 1, [0], 32, 1443, 86403, 1440, 0.1],
    # 5 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1444, 86404, 1440, 0.0],
    [22, 14, 1, [0], 32, 1444, 86404, 1440, 0.1],
    # 6 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1445, 86405, 1440, 0.0],
    [22, 14, 1, [0], 32, 1445, 86405, 1440, 0.1],
    # 7 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1446, 86406, 1440, 0.0],
    [22, 14, 1, [0], 32, 1446, 86406, 1440, 0.1],
    # 8 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1447, 86407, 1440, 0.0],
    [22, 14, 1, [0], 32, 1447, 86407, 1440, 0.1],
    # 9 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1448, 86408, 1440, 0.0],
    [22, 14, 1, [0], 32, 1448, 86408, 1440, 0.1],
    # 10 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1449, 86409, 1440, 0.0],
    [22, 14, 1, [0], 32, 1449, 86409, 1440, 0.1],
    # 11 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1450, 86410, 1440, 0.0],
    [22, 14, 1, [0], 32, 1450, 86410, 1440, 0.1],
    # 12 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1451, 86411, 1440, 0.0],
    [22, 14, 1, [0], 32, 1451, 86411, 1440, 0.1],
    # 13 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1452, 86412, 1440, 0.0],
    [22, 14, 1, [0], 32, 1452, 86412, 1440, 0.1],
    # 14 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1453, 86413, 1440, 0.0],
    [22, 14, 1, [0], 32, 1453, 86413, 1440, 0.1],
    # 15 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1454, 86414, 1440, 0.0],
    [22, 14, 1, [0], 32, 1454, 86414, 1440, 0.1],
    # 16 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1455, 86415, 1440, 0.0],
    [22, 14, 1, [0], 32, 1455, 86415, 1440, 0.1],
    # 17 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1456, 86416, 1440, 0.0],
    [22, 14, 1, [0], 32, 1456, 86416, 1440, 0.1],
    # 18 Чтение из ЗУ ЦМ
    [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1457, 86417, 1440, 0.0],
    [22, 14, 1, [0], 32, 1457, 86417, 1440, 0.1],
]]

all_test = ["Полный тест МБКАП по МКО", [
            # Инициализация МБКАП
            [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка времени
            [22, 17, 0, [0x0001, 0x0000, 100, 0x0000], 4, 10, 10, 0, 0.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.1],
            [22, 17, 0, [0x0003, 0x0001, 0x000B, 0x0000], 4, 10, 10, 0.0, 0.2],
            [22, 17, 0, [0x0003, 0x0002, 0x003C, 0x0000], 4, 10, 10, 0.0, 0.3],
            [22, 17, 0, [0x0003, 0x0003, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.4],
            # Чтение оперативных данных один раз в 5 секунд в течение 60 минут
            [22, 15, 1, [0], 32, 30, 3600, 5, 0],
            [22, 1, 1, [0], 32, 30, 3600, 5, 0.1],
            [22, 2, 1, [0], 32, 30, 3600, 5, 0.2],
            [22, 3, 1, [0], 32, 30, 3600, 5, 0.3],
            [22, 4, 1, [0], 32, 30, 3600, 5, 0.4],
            [22, 5, 1, [0], 32, 30, 3600, 5, 0.5],
            # Последовательное отключение модулей установкой уровня т.з. на небольшое значение
            [22, 17, 0, [0x0009, 0x0000, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 00.0],
            [22, 17, 0, [0x0009, 0x0001, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 10.0],
            [22, 17, 0, [0x0009, 0x0002, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 20.0],
            [22, 17, 0, [0x0009, 0x0003, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 30.0],
            [22, 17, 0, [0x0009, 0x0004, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 40.0],
            [22, 17, 0, [0x0009, 0x0005, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 50.0],
            [22, 17, 0, [0x0009, 0x0006, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 60.0],
            # Отключение токовой зашиты модулей заданием 0-х порогов тока
            [22, 17, 0, [0x0009, 0x0000, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 00.0],
            [22, 17, 0, [0x0009, 0x0001, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 10.0],
            [22, 17, 0, [0x0009, 0x0002, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 20.0],
            [22, 17, 0, [0x0009, 0x0003, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 30.0],
            [22, 17, 0, [0x0009, 0x0004, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 40.0],
            [22, 17, 0, [0x0009, 0x0005, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 50.0],
            [22, 17, 0, [0x0009, 0x0006, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 60.0],
            # Включение питания модулей: МБКАП и ЦМ не отключадлись, но статусы т.з сбрасываются при обращении к ним
            [22, 17, 0, [0x000A, 0x0000, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 00.1],
            [22, 17, 0, [0x000A, 0x0001, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 10.1],
            [22, 17, 0, [0x000A, 0x0002, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 20.1],
            [22, 17, 0, [0x000A, 0x0003, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 30.1],
            [22, 17, 0, [0x000A, 0x0004, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 40.1],
            [22, 17, 0, [0x000A, 0x0005, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 50.1],
            [22, 17, 0, [0x000A, 0x0006, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 60.1],
            # Сброс счетчиков и статусов неответов
            [22, 17, 0, [0x000E, 0x0000, 0x0000, 0x0000], 4, 1365, 1365, 0.0, 0.0],
            # Проверка подсчета разности времени синхронизации и времени ЦМ
            # (сразу после включения МПП, т.к. надо засинхронизовать время МПП)
            [22, 17, 0, [0x0001, 0x0000, 1502, 0x0000], 4, 1371, 1371, 0, 0.0],
            # Установк значение отсечки МПП в значение 10 (срабатывает на шум но не очень часто)
            [22, 17, 0, [0x0006, 0x0001, 0x000A, 0x0000], 4, 1401, 1401, 0.0, 0.1],
            [22, 17, 0, [0x0006, 0x0002, 0x000A, 0x0000], 4, 1401, 1401, 0.0, 10.1],
            # Запуск самотетсирования АДИИ
            [22, 17, 0, [0x0007, 0x0000, 0x0000, 0x0000], 4, 1501, 1501, 0.0, 0.1],
            # Включение режима констант
            [22, 17, 0, [0x0008, 0x0001, 0x0000, 0x0000], 4, 1601, 1601, 0.0, 0.1],
            # Выключение режима констант
            [22, 17, 0, [0x0008, 0x0000, 0x0000, 0x0000], 4, 1801, 1801, 0.0, 0.1],
            # Включение ускоренного режима для МПП27 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0001, 120], 4, 1801, 1801, 0.0, 0.1],
            # Включение ускоренного режима для МПП100 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0002, 120], 4, 2001, 2001, 0.0, 00.1],
            # Включение ускоренного режима для ДНТ на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0008, 120], 4, 2201, 2201, 0.0, 00.1],
            # Включение ускоренного режима для всех модулей на 15 минут
            [22, 17, 0, [0x000B, 0x0001, 0x000F, 900], 4, 2401, 2401, 0.0, 00.1],
            # Выключение ускоренного режима для всех модулей через 10 минут
            [22, 17, 0, [0x000B, 0x0000, 0x0000, 0x0000], 4, 3001, 3001, 0.0, 00.1],
            # Чтение из ЗУ ЦМ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 3601, 7200, 0.3, 0.0],
            [22, 14, 1, [0], 32, 3601, 7200, 0.3, 0.1],
            # Чтение оперативных данных один раз в 5 секунд
            [22, 15, 1, [0], 32, 7205, 7300, 5, 0],
            [22, 1, 1, [0], 32, 7205, 7300, 5, 0.1],
            [22, 2, 1, [0], 32, 7205, 7300, 5, 0.2],
            [22, 3, 1, [0], 32, 7205, 7300, 5, 0.3],
            [22, 4, 1, [0], 32, 7205, 7300, 5, 0.4],
            [22, 5, 1, [0], 32, 7205, 7300, 5, 0.5],
            # Перезагрузка по отключению ЦМ через команду управления питанием модулей
            [22, 17, 0, [0x000A, 0x0001, 0x0000, 0x0000], 4, 7305, 7305, 0.0, 1.0],
            # Установка времени
            [22, 17, 0, [0x0001, 0x0000, 7500, 0x0000], 4, 7315, 7315, 0.0, 1.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x0014, 0x0000], 4, 7315, 7315, 0.0, 1.1],
            [22, 17, 0, [0x0003, 0x0001, 0x0015, 0x0000], 4, 7315, 7315, 0.0, 1.2],
            [22, 17, 0, [0x0003, 0x0002, 0x0078, 0x0000], 4, 7315, 7315, 0.0, 1.3],
            [22, 17, 0, [0x0003, 0x0003, 0x0014, 0x0000], 4, 7315, 7315, 0.0, 1.4],
            # Чтение оперативных данных один раз в 5 секунд
            [22, 15, 1, [0], 32, 7330, 19000, 5, 0],
            [22, 1, 1, [0], 32, 7330, 19000, 5, 0.1],
            [22, 2, 1, [0], 32, 7330, 19000, 5, 0.2],
            [22, 3, 1, [0], 32, 7330, 19000, 5, 0.3],
            [22, 4, 1, [0], 32, 7330, 19000, 5, 0.4],
            [22, 5, 1, [0], 32, 7330, 19000, 5, 0.5],
            # Ждем до достижения защищенной области и свдигаем указатель в нее
            [22, 17, 0, [0x0005, 0x0000, 0x0000, 0x0000], 4, 19001, 19001, 0.0, 1.0],
            # Читаем ЗУ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 19002, 36000, 0.3, 0.0],
            [22, 14, 1, [0], 32, 19002, 36000, 0.3, 0.1],
            ]]

speedy_const_test = ["Режим констант+Ускоренный режим", [
            # Инициализация МБКАП
            [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка времени
            [22, 17, 0, [0x0001, 0x0000, 100, 0x0000], 4, 10, 10, 0, 0.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.1],
            [22, 17, 0, [0x0003, 0x0001, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.2],
            [22, 17, 0, [0x0003, 0x0002, 0x003C, 0x0000], 4, 10, 10, 0.0, 0.3],
            [22, 17, 0, [0x0003, 0x0003, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.4],
            # Установк значение отсечки МПП в значение 10 (срабатывает на шум но не очень часто)
            [22, 17, 0, [0x0006, 0x0001, 0x0002, 0x0000], 4, 12, 12, 0.0, 0.1],
            [22, 17, 0, [0x0006, 0x0002, 0x0002, 0x0000], 4, 12, 12, 0.0, 0.2],
            # Включение режима констант
            [22, 17, 0, [0x0008, 0x0001, 0x0000, 0x0000], 4, 15, 15, 0.0, 0.1],
            # Выключение режима констант
            [22, 17, 0, [0x0008, 0x0000, 0x0000, 0x0000], 4, 300, 300, 0.0, 0.1],
            # Включение ускоренного режима для МПП27 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0001, 120], 4, 300, 300, 0.0, 2.0],
            # Включение ускоренного режима для МПП100 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0002, 120], 4, 450, 450, 0.0, 2.0],
            # Включение ускоренного режима для ДНТ на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0008, 120], 4, 600, 600, 0.0, 2.0],
            # Включение ускоренного режима для всех модулей на 4 минут
            [22, 17, 0, [0x000B, 0x0001, 0x000F, 240], 4, 750, 750, 0.0, 2.0],
            # Выключение ускоренного режима для всех модулей через 3 минут
            [22, 17, 0, [0x000B, 0x0000, 0x0000, 0x0000], 4, 930, 930, 0.0, 00.1],
            # Чтение из ЗУ ЦМ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 1000, 1200, 0.2, 0.0],
            [22, 14, 1, [0], 32,  1000, 1200, 0.2, 0.1],
            ]]

no_answer_test = ["Тестирование неответов при оключении включении модулей", [
            # Инициализация МБКАП
            [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.0],
            [22, 17, 0, [0x0003, 0x0001, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.1],
            [22, 17, 0, [0x0003, 0x0002, 0x003C, 0x0000], 4, 10, 10, 0.0, 0.2],
            [22, 17, 0, [0x0003, 0x0003, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.3],
            # Чтение оперативных данных один раз в 5 секунд в течение 60 минут
            [22, 15, 1, [0], 32, 11, 3600, 5, 0],
            [22, 1, 1, [0], 32, 11, 3600, 5, 0.1],
            [22, 2, 1, [0], 32, 11, 3600, 5, 0.2],
            [22, 3, 1, [0], 32, 11, 3600, 5, 0.3],
            [22, 4, 1, [0], 32, 11, 3600, 5, 0.4],
            [22, 5, 1, [0], 32, 11, 3600, 5, 0.5],
            # Последовательное отключение-включение МБКАП
            [22, 17, 0, [0x0009, 0x0000, 0x000A, 0x0000], 4, 100, 100, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0000, 0x0000, 0x0000], 4, 190, 190, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0000, 0x0001, 0x0000], 4, 195, 195, 0.0, 0.0],
            # Последовательное отключение модуля ЦМ
            [22, 17, 0, [0x0009, 0x0001, 0x000A, 0x0000], 4, 200, 200, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0001, 0x0000, 0x0000], 4, 290, 290, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0001, 0x0001, 0x0000], 4, 295, 295, 0.0, 0.0],
            # Последовательное отключение модуля МПП27
            [22, 17, 0, [0x0009, 0x0002, 0x000A, 0x0000], 4, 300, 300, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0002, 0x0000, 0x0000], 4, 390, 390, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0002, 0x0001, 0x0000], 4, 395, 395, 0.0, 0.0],
            # Последовательное отключение модуля МПП100
            [22, 17, 0, [0x0009, 0x0003, 0x000A, 0x0000], 4, 400, 400, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0003, 0x0000, 0x0000], 4, 490, 490, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0003, 0x0001, 0x0000], 4, 495, 495, 0.0, 0.0],
            # Последовательное отключение модуля ДИР
            [22, 17, 0, [0x0009, 0x0004, 0x000A, 0x0000], 4, 500, 500, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0004, 0x0000, 0x0000], 4, 590, 590, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0004, 0x0001, 0x0000], 4, 595, 595, 0.0, 0.0],
            # Последовательное отключение модуля ДНТ
            [22, 17, 0, [0x0009, 0x0005, 0x000A, 0x0000], 4, 600, 600, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0005, 0x0000, 0x0000], 4, 690, 690, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0005, 0x0001, 0x0000], 4, 695, 695, 0.0, 0.0],
            # Последовательное отключение модуля АДИИ
            [22, 17, 0, [0x0009, 0x0006, 0x000A, 0x0000], 4, 700, 700, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0006, 0x0000, 0x0000], 4, 790, 790, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0006, 0x0001, 0x0000], 4, 795, 795, 0.0, 0.0],
            ]]

all_test_without_modules_poweroff_by_current_protection = ["Полный тест МБКАП по МКО без отключения модулей через токовую защиту", [
            # Инициализация МБКАП
            [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка времени
            [22, 17, 0, [0x0001, 0x0000, 100, 0x0000], 4, 10, 10, 0, 0.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.1],
            [22, 17, 0, [0x0003, 0x0001, 0x000B, 0x0000], 4, 10, 10, 0.0, 0.2],
            [22, 17, 0, [0x0003, 0x0002, 0x003C, 0x0000], 4, 10, 10, 0.0, 0.3],
            [22, 17, 0, [0x0003, 0x0003, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.4],
            # Чтение оперативных данных один раз в 5 секунд в течение 60 минут
            [22, 15, 1, [0], 32, 30, 3600, 5, 0],
            [22, 1, 1, [0], 32, 30, 3600, 5, 0.1],
            [22, 2, 1, [0], 32, 30, 3600, 5, 0.2],
            [22, 3, 1, [0], 32, 30, 3600, 5, 0.3],
            [22, 4, 1, [0], 32, 30, 3600, 5, 0.4],
            [22, 5, 1, [0], 32, 30, 3600, 5, 0.5],
            # Проверка подсчета разности времени синхронизации и времени ЦМ
            # (сразу после включения МПП, т.к. надо засинхронизовать время МПП)
            [22, 17, 0, [0x0001, 0x0000, 1502, 0x0000], 4, 1371, 1371, 0, 0.0],
            # Установк значение отсечки МПП в значение 10 (срабатывает на шум но не очень часто)
            [22, 17, 0, [0x0006, 0x0001, 0x000A, 0x0000], 4, 1401, 1401, 0.0, 0.1],
            [22, 17, 0, [0x0006, 0x0002, 0x000A, 0x0000], 4, 1401, 1401, 0.0, 10.1],
            # Запуск самотетсирования АДИИ
            [22, 17, 0, [0x0007, 0x0000, 0x0000, 0x0000], 4, 1501, 1501, 0.0, 0.1],
            # Включение режима констант
            [22, 17, 0, [0x0008, 0x0001, 0x0000, 0x0000], 4, 1601, 1601, 0.0, 0.1],
            # Выключение режима констант
            [22, 17, 0, [0x0008, 0x0000, 0x0000, 0x0000], 4, 1801, 1801, 0.0, 0.1],
            # Включение ускоренного режима для МПП27 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0001, 120], 4, 1801, 1801, 0.0, 0.1],
            # Включение ускоренного режима для МПП100 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0002, 120], 4, 2001, 2001, 0.0, 00.1],
            # Включение ускоренного режима для ДНТ на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0008, 120], 4, 2201, 2201, 0.0, 00.1],
            # Включение ускоренного режима для всех модулей на 15 минут
            [22, 17, 0, [0x000B, 0x0001, 0x000F, 900], 4, 2401, 2401, 0.0, 00.1],
            # Выключение ускоренного режима для всех модулей через 10 минут
            [22, 17, 0, [0x000B, 0x0000, 0x0000, 0x0000], 4, 3001, 3001, 0.0, 00.1],
            # Чтение из ЗУ ЦМ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 3601, 7200, 0.3, 0.0],
            [22, 14, 1, [0], 32, 3601, 7200, 0.3, 0.1],
            # Чтение оперативных данных один раз в 5 секунд
            [22, 15, 1, [0], 32, 7205, 7300, 5, 0],
            [22, 1, 1, [0], 32, 7205, 7300, 5, 0.1],
            [22, 2, 1, [0], 32, 7205, 7300, 5, 0.2],
            [22, 3, 1, [0], 32, 7205, 7300, 5, 0.3],
            [22, 4, 1, [0], 32, 7205, 7300, 5, 0.4],
            [22, 5, 1, [0], 32, 7205, 7300, 5, 0.5],
            # Перезагрузка по отключению ЦМ через команду управления питанием модулей
            [22, 17, 0, [0x000A, 0x0001, 0x0000, 0x0000], 4, 7305, 7305, 0.0, 1.0],
            # Установка времени
            [22, 17, 0, [0x0001, 0x0000, 7500, 0x0000], 4, 7315, 7315, 0.0, 1.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x0014, 0x0000], 4, 7315, 7315, 0.0, 1.1],
            [22, 17, 0, [0x0003, 0x0001, 0x0015, 0x0000], 4, 7315, 7315, 0.0, 1.2],
            [22, 17, 0, [0x0003, 0x0002, 0x0078, 0x0000], 4, 7315, 7315, 0.0, 1.3],
            [22, 17, 0, [0x0003, 0x0003, 0x0014, 0x0000], 4, 7315, 7315, 0.0, 1.4],
            # Чтение оперативных данных один раз в 5 секунд
            [22, 15, 1, [0], 32, 7330, 19000, 5, 0],
            [22, 1, 1, [0], 32, 7330, 19000, 5, 0.1],
            [22, 2, 1, [0], 32, 7330, 19000, 5, 0.2],
            [22, 3, 1, [0], 32, 7330, 19000, 5, 0.3],
            [22, 4, 1, [0], 32, 7330, 19000, 5, 0.4],
            [22, 5, 1, [0], 32, 7330, 19000, 5, 0.5],
            # Ждем до достижения защищенной области и свдигаем указатель в нее
            [22, 17, 0, [0x0005, 0x0000, 0x0000, 0x0000], 4, 19001, 19001, 0.0, 1.0],
            # Читаем ЗУ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 19002, 36000, 0.3, 0.0],
            [22, 14, 1, [0], 32, 19002, 36000, 0.3, 0.1],
            ]]


reset_test = ["Тестирование инициализации", [
            # Инициализация МБКАП
            [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 1, 1, 0.0, 0.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x000A, 0x0000], 4, 9, 9, 0.0, 0.1],
            [22, 17, 0, [0x0003, 0x0001, 0x000B, 0x0000], 4, 9, 9, 0.0, 0.2],
            [22, 17, 0, [0x0003, 0x0002, 0x003C, 0x0000], 4, 9, 9, 0.0, 0.3],
            [22, 17, 0, [0x0003, 0x0003, 0x000A, 0x0000], 4, 9, 9, 0.0, 0.4],
            # Чтение оперативных данных один раз в 5 секунд в течение 60 минут
            [22, 15, 1, [0], 32, 10, 60, 5, 0],
            [22, 1, 1, [0], 32, 10, 60, 5, 0.1],
            [22, 2, 1, [0], 32, 10, 60, 5, 0.2],
            [22, 3, 1, [0], 32, 10, 60, 5, 0.3],
            [22, 4, 1, [0], 32, 10, 60, 5, 0.4],
            [22, 5, 1, [0], 32, 10, 60, 5, 0.5],
            # Чтение из ЗУ ЦМ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 60, 65, 0.3, 0.0],
            [22, 14, 1, [0], 32, 60, 65, 0.3, 0.1],
            ]]
