# класс для разбора подпрограмм для создания циклограмм
# циклограмма согласно данному шаблону
# ["Name", [[Address, Subaddress, Wr/R, [Data], Data leng, Start time, Finish time, Interval, Delay], [...], [...]]]
#    |          |          |        |      |         |          |           |          |         |
#    |          |          |        |      |         |          |           |          |         -- Задержка отправки
#    |          |          |        |      |         |          |           |          --- Интервал отправки
#    |          |          |        |      |         |          |           - Время остановки посылок
#    |          |          |        |      |         |          --- Время старта отправки от запуска программы
#    |          |          |        |      |         --- Длина данных для приема/отправки
#    |          |          |        |      ------------- Данные для отправки (при приеме не имеет значения)
#    |          |          |        -------------------- Отправка - "0", Прием - "1"
#    |          |          ----------------------------- Подадрес
#    |          ---------------------------------------- Адрес ОУ
#    --------------------------------------------------- Имя циклограммы

# опрос всего:

all_test = ["Полный тест МБКАП оп МКО", [
            # Инициализация МБКАП
            [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка времени
            [22, 17, 0, [0x0001, 0x0000, 100, 0x0000], 4, 10, 10, 0, 0.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.1],
            [22, 17, 0, [0x0003, 0x0001, 0x000B, 0x0000], 4, 10, 10, 0.0, 0.2],
            [22, 17, 0, [0x0003, 0x0002, 0x003C, 0x0000], 4, 10, 10, 0.0, 0.3],
            [22, 17, 0, [0x0003, 0x0003, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.4],
            # Чтение оперативных данных один раз в 5 секунд в течение 60 минут
            [22, 15, 1, [0], 32, 30, 3600, 5, 0],
            [22, 1, 1, [0], 32, 30, 3600, 5, 0.1],
            [22, 2, 1, [0], 32, 30, 3600, 5, 0.2],
            [22, 3, 1, [0], 32, 30, 3600, 5, 0.3],
            [22, 4, 1, [0], 32, 30, 3600, 5, 0.4],
            [22, 5, 1, [0], 32, 30, 3600, 5, 0.5],
            # Последовательное отключение модулей установкой уровня т.з. на небольшое значение
            [22, 17, 0, [0x0009, 0x0000, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 00.0],
            [22, 17, 0, [0x0009, 0x0001, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 10.0],
            [22, 17, 0, [0x0009, 0x0002, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 20.0],
            [22, 17, 0, [0x0009, 0x0003, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 30.0],
            [22, 17, 0, [0x0009, 0x0004, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 40.0],
            [22, 17, 0, [0x0009, 0x0005, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 50.0],
            [22, 17, 0, [0x0009, 0x0006, 0x000A, 0x0000], 4, 1001, 1001, 0.0, 60.0],
            # Отключение токовой зашиты модулей заданием 0-х порогов тока
            [22, 17, 0, [0x0009, 0x0000, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 00.0],
            [22, 17, 0, [0x0009, 0x0001, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 10.0],
            [22, 17, 0, [0x0009, 0x0002, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 20.0],
            [22, 17, 0, [0x0009, 0x0003, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 30.0],
            [22, 17, 0, [0x0009, 0x0004, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 40.0],
            [22, 17, 0, [0x0009, 0x0005, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 50.0],
            [22, 17, 0, [0x0009, 0x0006, 0x0000, 0x0000], 4, 1301, 1301, 0.0, 60.0],
            # Включение питания модулей: МБКАП и ЦМ не отключадлись, но статусы т.з сбрасываются при обращении к ним
            [22, 17, 0, [0x000A, 0x0000, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 00.1],
            [22, 17, 0, [0x000A, 0x0001, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 10.1],
            [22, 17, 0, [0x000A, 0x0002, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 20.1],
            [22, 17, 0, [0x000A, 0x0003, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 30.1],
            [22, 17, 0, [0x000A, 0x0004, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 40.1],
            [22, 17, 0, [0x000A, 0x0005, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 50.1],
            [22, 17, 0, [0x000A, 0x0006, 0x0001, 0x0000], 4, 1301, 1301, 0.0, 60.1],
            # Проверка подсчета разности времени синхронизации и времени ЦМ
            # (сразу после включения МПП, т.к. надо засинхронизовать время МПП)
            [22, 17, 0, [0x0001, 0x0000, 1502, 0x0000], 4, 1371, 1371, 0, 0.0],
            # Установк значение отсечки МПП в значение 10 (срабатывает на шум но не очень часто)
            [22, 17, 0, [0x0006, 0x0001, 0x000A, 0x0000], 4, 1401, 1401, 0.0, 0.1],
            [22, 17, 0, [0x0006, 0x0002, 0x000A, 0x0000], 4, 1401, 1401, 0.0, 10.1],
            # Запуск самотетсирования АДИИ
            [22, 17, 0, [0x0007, 0x0000, 0x0000, 0x0000], 4, 1501, 1501, 0.0, 0.1],
            # Включение режима констант
            [22, 17, 0, [0x0008, 0x0001, 0x0000, 0x0000], 4, 1601, 1601, 0.0, 0.1],
            # Выключение режима констант
            [22, 17, 0, [0x0008, 0x0000, 0x0000, 0x0000], 4, 1801, 1801, 0.0, 0.1],
            # Включение ускоренного режима для МПП27 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0001, 120], 4, 1801, 1801, 0.0, 0.1],
            # Включение ускоренного режима для МПП100 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0002, 120], 4, 2001, 2001, 0.0, 00.1],
            # Включение ускоренного режима для ДНТ на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0008, 120], 4, 2201, 2201, 0.0, 00.1],
            # Включение ускоренного режима для всех модулей на 15 минут
            [22, 17, 0, [0x000B, 0x0001, 0x000F, 900], 4, 2401, 2401, 0.0, 00.1],
            # Выключение ускоренного режима для всех модулей через 10 минут
            [22, 17, 0, [0x000B, 0x0000, 0x0000, 0x0000], 4, 3001, 3001, 0.0, 00.1],
            # Чтение из ЗУ ЦМ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 3601, 7200, 0.3, 0.0],
            [22, 14, 1, [0], 32, 3601, 7200, 0.3, 0.1],
            # Чтение оперативных данных один раз в 5 секунд
            [22, 15, 1, [0], 32, 7205, 7300, 5, 0],
            [22, 1, 1, [0], 32, 7205, 7300, 5, 0.1],
            [22, 2, 1, [0], 32, 7205, 7300, 5, 0.2],
            [22, 3, 1, [0], 32, 7205, 7300, 5, 0.3],
            [22, 4, 1, [0], 32, 7205, 7300, 5, 0.4],
            [22, 5, 1, [0], 32, 7205, 7300, 5, 0.5],
            # Перезагрузка по отключению ЦМ через команду управления питанием модулей
            [22, 17, 0, [0x000A, 0x0001, 0x0000, 0x0000], 4, 7305, 7305, 0.0, 1.0],
            # Установка времени
            [22, 17, 0, [0x0001, 0x0000, 7500, 0x0000], 4, 7315, 7315, 0.0, 1.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x0014, 0x0000], 4, 7315, 7315, 0.0, 1.1],
            [22, 17, 0, [0x0003, 0x0001, 0x0015, 0x0000], 4, 7315, 7315, 0.0, 1.2],
            [22, 17, 0, [0x0003, 0x0002, 0x0078, 0x0000], 4, 7315, 7315, 0.0, 1.3],
            [22, 17, 0, [0x0003, 0x0003, 0x0014, 0x0000], 4, 7315, 7315, 0.0, 1.4],
            # Чтение оперативных данных один раз в 5 секунд
            [22, 15, 1, [0], 32, 7330, 19000, 5, 0],
            [22, 1, 1, [0], 32, 7330, 19000, 5, 0.1],
            [22, 2, 1, [0], 32, 7330, 19000, 5, 0.2],
            [22, 3, 1, [0], 32, 7330, 19000, 5, 0.3],
            [22, 4, 1, [0], 32, 7330, 19000, 5, 0.4],
            [22, 5, 1, [0], 32, 7330, 19000, 5, 0.5],
            # Ждем до достижения защищенной области и свдигаем указатель в нее
            [22, 17, 0, [0x0005, 0x0000, 0x0000, 0x0000], 4, 19001, 19001, 0.0, 1.0],
            # Читаем ЗУ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 19002, 36000, 0.3, 0.0],
            [22, 14, 1, [0], 32, 19002, 36000, 0.3, 0.1],
            ]]


no_answer_test = ["Тестирование неответов при оключении включении модулей", [
            # Инициализация МБКАП
            [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.0],
            [22, 17, 0, [0x0003, 0x0001, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.1],
            [22, 17, 0, [0x0003, 0x0002, 0x003C, 0x0000], 4, 10, 10, 0.0, 0.2],
            [22, 17, 0, [0x0003, 0x0003, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.3],
            # Чтение оперативных данных один раз в 5 секунд в течение 60 минут
            [22, 15, 1, [0], 32, 11, 3600, 5, 0],
            [22, 1, 1, [0], 32, 11, 3600, 5, 0.1],
            [22, 2, 1, [0], 32, 11, 3600, 5, 0.2],
            [22, 3, 1, [0], 32, 11, 3600, 5, 0.3],
            [22, 4, 1, [0], 32, 11, 3600, 5, 0.4],
            [22, 5, 1, [0], 32, 11, 3600, 5, 0.5],
            # Последовательное отключение-включение МБКАП
            [22, 17, 0, [0x0009, 0x0000, 0x000A, 0x0000], 4, 100, 100, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0000, 0x0000, 0x0000], 4, 190, 190, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0000, 0x0001, 0x0000], 4, 195, 195, 0.0, 0.0],
            # Последовательное отключение модуля ЦМ
            [22, 17, 0, [0x0009, 0x0001, 0x000A, 0x0000], 4, 200, 200, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0001, 0x0000, 0x0000], 4, 290, 290, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0001, 0x0001, 0x0000], 4, 295, 295, 0.0, 0.0],
            # Последовательное отключение модуля МПП27
            [22, 17, 0, [0x0009, 0x0002, 0x000A, 0x0000], 4, 300, 300, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0002, 0x0000, 0x0000], 4, 390, 390, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0002, 0x0001, 0x0000], 4, 395, 395, 0.0, 0.0],
            # Последовательное отключение модуля МПП100
            [22, 17, 0, [0x0009, 0x0003, 0x000A, 0x0000], 4, 400, 400, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0003, 0x0000, 0x0000], 4, 490, 490, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0003, 0x0001, 0x0000], 4, 495, 495, 0.0, 0.0],
            # Последовательное отключение модуля ДИР
            [22, 17, 0, [0x0009, 0x0004, 0x000A, 0x0000], 4, 500, 500, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0004, 0x0000, 0x0000], 4, 590, 590, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0004, 0x0001, 0x0000], 4, 595, 595, 0.0, 0.0],
            # Последовательное отключение модуля ДНТ
            [22, 17, 0, [0x0009, 0x0005, 0x000A, 0x0000], 4, 600, 600, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0005, 0x0000, 0x0000], 4, 690, 690, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0005, 0x0001, 0x0000], 4, 695, 695, 0.0, 0.0],
            # Последовательное отключение модуля АДИИ
            [22, 17, 0, [0x0009, 0x0006, 0x000A, 0x0000], 4, 700, 700, 0.0, 0.0],
            [22, 17, 0, [0x0009, 0x0006, 0x0000, 0x0000], 4, 790, 790, 0.0, 0.0],
            [22, 17, 0, [0x000A, 0x0006, 0x0001, 0x0000], 4, 795, 795, 0.0, 0.0],
            ]]

all_test_without_modules_poweroff_by_current_protection = ["Полный тест МБКАП по МКО без отключения модулей через токовую защиту", [
            # Инициализация МБКАП
            [22, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка времени
            [22, 17, 0, [0x0001, 0x0000, 100, 0x0000], 4, 10, 10, 0, 0.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.1],
            [22, 17, 0, [0x0003, 0x0001, 0x000B, 0x0000], 4, 10, 10, 0.0, 0.2],
            [22, 17, 0, [0x0003, 0x0002, 0x003C, 0x0000], 4, 10, 10, 0.0, 0.3],
            [22, 17, 0, [0x0003, 0x0003, 0x000A, 0x0000], 4, 10, 10, 0.0, 0.4],
            # Чтение оперативных данных один раз в 5 секунд в течение 60 минут
            [22, 15, 1, [0], 32, 30, 3600, 5, 0],
            [22, 1, 1, [0], 32, 30, 3600, 5, 0.1],
            [22, 2, 1, [0], 32, 30, 3600, 5, 0.2],
            [22, 3, 1, [0], 32, 30, 3600, 5, 0.3],
            [22, 4, 1, [0], 32, 30, 3600, 5, 0.4],
            [22, 5, 1, [0], 32, 30, 3600, 5, 0.5],
            # Проверка подсчета разности времени синхронизации и времени ЦМ
            # (сразу после включения МПП, т.к. надо засинхронизовать время МПП)
            [22, 17, 0, [0x0001, 0x0000, 1502, 0x0000], 4, 1371, 1371, 0, 0.0],
            # Установк значение отсечки МПП в значение 10 (срабатывает на шум но не очень часто)
            [22, 17, 0, [0x0006, 0x0001, 0x000A, 0x0000], 4, 1401, 1401, 0.0, 0.1],
            [22, 17, 0, [0x0006, 0x0002, 0x000A, 0x0000], 4, 1401, 1401, 0.0, 10.1],
            # Запуск самотетсирования АДИИ
            [22, 17, 0, [0x0007, 0x0000, 0x0000, 0x0000], 4, 1501, 1501, 0.0, 0.1],
            # Включение режима констант
            [22, 17, 0, [0x0008, 0x0001, 0x0000, 0x0000], 4, 1601, 1601, 0.0, 0.1],
            # Выключение режима констант
            [22, 17, 0, [0x0008, 0x0000, 0x0000, 0x0000], 4, 1801, 1801, 0.0, 0.1],
            # Включение ускоренного режима для МПП27 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0001, 120], 4, 1801, 1801, 0.0, 0.1],
            # Включение ускоренного режима для МПП100 на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0002, 120], 4, 2001, 2001, 0.0, 00.1],
            # Включение ускоренного режима для ДНТ на 2 минуты
            [22, 17, 0, [0x000B, 0x0001, 0x0008, 120], 4, 2201, 2201, 0.0, 00.1],
            # Включение ускоренного режима для всех модулей на 15 минут
            [22, 17, 0, [0x000B, 0x0001, 0x000F, 900], 4, 2401, 2401, 0.0, 00.1],
            # Выключение ускоренного режима для всех модулей через 10 минут
            [22, 17, 0, [0x000B, 0x0000, 0x0000, 0x0000], 4, 3001, 3001, 0.0, 00.1],
            # Чтение из ЗУ ЦМ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 3601, 7200, 0.3, 0.0],
            [22, 14, 1, [0], 32, 3601, 7200, 0.3, 0.1],
            # Чтение оперативных данных один раз в 5 секунд
            [22, 15, 1, [0], 32, 7205, 7300, 5, 0],
            [22, 1, 1, [0], 32, 7205, 7300, 5, 0.1],
            [22, 2, 1, [0], 32, 7205, 7300, 5, 0.2],
            [22, 3, 1, [0], 32, 7205, 7300, 5, 0.3],
            [22, 4, 1, [0], 32, 7205, 7300, 5, 0.4],
            [22, 5, 1, [0], 32, 7205, 7300, 5, 0.5],
            # Перезагрузка по отключению ЦМ через команду управления питанием модулей
            [22, 17, 0, [0x000A, 0x0001, 0x0000, 0x0000], 4, 7305, 7305, 0.0, 1.0],
            # Установка времени
            [22, 17, 0, [0x0001, 0x0000, 7500, 0x0000], 4, 7315, 7315, 0.0, 1.0],
            # Установка интервала измерения для проверки изменения интервал по умолчанию
            [22, 17, 0, [0x0003, 0x0000, 0x0014, 0x0000], 4, 7315, 7315, 0.0, 1.1],
            [22, 17, 0, [0x0003, 0x0001, 0x0015, 0x0000], 4, 7315, 7315, 0.0, 1.2],
            [22, 17, 0, [0x0003, 0x0002, 0x0078, 0x0000], 4, 7315, 7315, 0.0, 1.3],
            [22, 17, 0, [0x0003, 0x0003, 0x0014, 0x0000], 4, 7315, 7315, 0.0, 1.4],
            # Чтение оперативных данных один раз в 5 секунд
            [22, 15, 1, [0], 32, 7330, 19000, 5, 0],
            [22, 1, 1, [0], 32, 7330, 19000, 5, 0.1],
            [22, 2, 1, [0], 32, 7330, 19000, 5, 0.2],
            [22, 3, 1, [0], 32, 7330, 19000, 5, 0.3],
            [22, 4, 1, [0], 32, 7330, 19000, 5, 0.4],
            [22, 5, 1, [0], 32, 7330, 19000, 5, 0.5],
            # Ждем до достижения защищенной области и свдигаем указатель в нее
            [22, 17, 0, [0x0005, 0x0000, 0x0000, 0x0000], 4, 19001, 19001, 0.0, 1.0],
            # Читаем ЗУ
            [22, 18, 0, [0x0000, 0x0000, 0x0000, 0x0000], 4, 19002, 36000, 0.3, 0.0],
            [22, 14, 1, [0], 32, 19002, 36000, 0.3, 0.1],
            ]]