# класс для разбора подпрограмм для создания циклограмм
# циклограмма согласно данному шаблону
# ["Name", [[Address, Subaddress, Wr/R, [Data], Data leng, Start time, Finish time, Interval, Delay], [...], [...]]]
#    |          |          |        |      |         |          |           |          |         |
#    |          |          |        |      |         |          |           |          |         -- Задержка отправки
#    |          |          |        |      |         |          |           |          --- Интервал отправки
#    |          |          |        |      |         |          |           - Время остановки посылок
#    |          |          |        |      |         |          --- Время старта отправки от запуска программы
#    |          |          |        |      |         --- Длина данных для приема/отправки
#    |          |          |        |      ------------- Данные для отправки (при приеме не имеет значения)
#    |          |          |        -------------------- Отправка - "0", Прием - "1"
#    |          |          ----------------------------- Подадрес
#    |          ---------------------------------------- Адрес ОУ
#    --------------------------------------------------- Имя циклограммы

# опрос всего:
all_test = ["Полный тест СКЭ-ЛР", [
            # Инициализация СКЭ
            [13, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка времени на 100 секунд
            [13, 29, 0, [0x002E, 0x0000, 10+100, 0x0000], 4, 10, 10, 0, 0.0],
            # Чтение оперативных данных один раз в 2 секунд в течение 60 минут
            [13, 15, 1, [0], 32, 30, 3600, 2, 0],
            [13, 1, 1, [0], 32, 30, 3600, 2, 0.1],
            [13, 2, 1, [0], 32, 30, 3600, 2, 0.2],
            [13, 3, 1, [0], 32, 30, 3600, 2, 0.3],
            [13, 4, 1, [0], 32, 30, 3600, 2, 0.4],
            [13, 5, 1, [0], 32, 30, 3600, 2, 0.5],
            [13, 6, 1, [0], 32, 30, 3600, 2, 0.6],
            [13, 7, 1, [0], 32, 30, 3600, 2, 0.7],
            [13, 8, 1, [0], 32, 30, 3600, 2, 0.8],
            [13, 9, 1, [0], 32, 30, 3600, 2, 0.9],
            # установка интервала измерения для проверки интервала по умолчанию
            # принудительное включение интервала измерения и формирования системного кадра на 10 с через ТП30
            [13, 30, 0, [0x3, 10, 10, 0], 4, 501, 501, 0, 0.0],
            # последовательное отключение модулей установкой уровня токовой защиты на небольшое значение
            [13, 17, 0, [0x9, 30, 180, 180], 4, 1001, 1001, 0, 0.0],
            [13, 17, 0, [0x9, 30, 30, 180], 4, 1001, 1001, 0, 20.0],
            [13, 17, 0, [0x9, 30, 30, 30], 4, 1001, 1001, 0, 40.0],
            # последовательное отключение токовой защиты заданием нулевых значений порогов
            [13, 17, 0, [0x9, 0, 0, 0], 4, 1301, 1301, 0, 0.0],
            # последовательное включение питания модулей
            [13, 17, 0, [0xA, 0x3, 0, 0], 4, 1301, 1301, 0, 0.0],
            [13, 17, 0, [0xA, 0x7, 0, 0], 4, 1301, 1301, 0, 20.0],
            [13, 17, 0, [0xA, 0xF, 0, 0], 4, 1301, 1301, 0, 40.0],
            # Проверка подсчета разности времени синхронизации и времени ЦМ
            # (сразу после включения МПП, т.к. надо засинхронизовать время МПП)
            [13, 29, 0, [0x002E, 0x0000, 1341+100+100, 0x0000], 4, 1351, 1351, 0, 0.1],
            # Включение ускоренного режима для всех модулей
            [13, 17, 0, [0x000B, 0x0001, 0x01FF, 0x0000], 4, 1401, 1401, 0.0, 0.0],
            # Отключение ускоренного режима через 10 минут
            [13, 17, 0, [0x000B, 0x0000, 0x01FF, 0x0000], 4, 2001, 2001, 0.0, 0.0],
            # команда на старт сеанса съема информации
            [13, 17, 0, [0x0007, 0x0000, 0x0000, 0x0000], 4, 3601, 3600, 0.0, 1.0],
            # ЗУ БЭ
            [13, 18, 0, [0, 0, 0, 0], 4, 3610, 4500, 0.2, 0.0],
            [13, 14, 1, [0], 32, 3610, 4500, 0.2, 0.1],
            # установка измерительного интервала на 60 с
            [13, 17, 0, [0x03, 0, 0, 0], 4, 4510, 4510, 0, 0.0],
            # установка границ окон
            [13, 17, 0, [0x05, 1, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.0],
            [13, 17, 0, [0x05, 2, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.1],
            [13, 17, 0, [0x05, 3, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.2],
            [13, 17, 0, [0x05, 4, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.3],
            [13, 17, 0, [0x05, 5, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.4],
            [13, 17, 0, [0x05, 6, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.5],
            # установка отсече МПП и границ окон
            [13, 17, 0, [0x06, 1, 10, 0], 4, 4510, 4510, 0, 1.0],
            [13, 17, 0, [0x06, 2, 10, 0], 4, 4510, 4510, 0, 1.1],
            [13, 17, 0, [0x06, 3, 10, 0], 4, 4510, 4510, 0, 1.2],
            [13, 17, 0, [0x06, 4, 10, 0], 4, 4510, 4510, 0, 1.3],
            [13, 17, 0, [0x06, 5, 10, 0], 4, 4510, 4510, 0, 1.4],
            [13, 17, 0, [0x06, 6, 10, 0], 4, 4510, 4510, 0, 1.5],
            # Блок опроса ЗУ МПП
            [13, 19, 0, [0, 1, 0, 0], 4, 4520, 5000, 2.0, 0.0],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 0.1],
            [13, 19, 0, [0, 2, 0, 0], 4, 4520, 5000, 2.0, 0.3],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 0.4],
            [13, 19, 0, [0, 3, 0, 0], 4, 4520, 5000, 2.0, 0.6],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 0.7],
            [13, 19, 0, [0, 4, 0, 0], 4, 4520, 5000, 2.0, 0.9],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 1.0],
            [13, 19, 0, [0, 5, 0, 0], 4, 4520, 5000, 2.0, 1.2],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 1.3],
            [13, 19, 0, [0, 6, 0, 0], 4, 4520, 5000, 2.0, 1.5],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 1.6],
            # принудительное включение интервала измерения и формирования системного кадра на 10 с через ТП30
            [13, 30, 0, [0x3, 10, 10, 0], 4, 5002, 5002, 0, 0.0],
            # ЗУ БЭ
            [13, 18, 0, [0, 0, 0, 0], 4, 5003, 36000, 0.2, 0.0],
            [13, 14, 1, [0], 32, 5003, 36000, 0.2, 0.1],
            ]]

all_test_without_current_protection = ["Полный тест СЭ-ЛР без токовой защиты", [
            # Инициализация СКЭ
            [13, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка времени на 100 секунд
            [13, 29, 0, [0x002E, 0x0000, 10+100, 0x0000], 4, 10, 10, 0, 0.0],
            # Чтение оперативных данных один раз в 2 секунд в течение 60 минут
            [13, 15, 1, [0], 32, 30, 3600, 2, 0],
            [13, 1, 1, [0], 32, 30, 3600, 2, 0.1],
            [13, 2, 1, [0], 32, 30, 3600, 2, 0.2],
            [13, 3, 1, [0], 32, 30, 3600, 2, 0.3],
            [13, 4, 1, [0], 32, 30, 3600, 2, 0.4],
            [13, 5, 1, [0], 32, 30, 3600, 2, 0.5],
            [13, 6, 1, [0], 32, 30, 3600, 2, 0.6],
            [13, 7, 1, [0], 32, 30, 3600, 2, 0.7],
            [13, 8, 1, [0], 32, 30, 3600, 2, 0.8],
            [13, 9, 1, [0], 32, 30, 3600, 2, 0.9],
            # установка интервала измерения для проверки интервала по умолчанию
            # принудительное включение интервала измерения и формирования системного кадра на 10 с через ТП30
            [13, 30, 0, [0x3, 10, 10, 0], 4, 501, 501, 0, 0.0],
            # Проверка подсчета разности времени синхронизации и времени ЦМ
            # (сразу после включения МПП, т.к. надо засинхронизовать время МПП)
            [13, 29, 0, [0x002E, 0x0000, 1341+100+100, 0x0000], 4, 1351, 1351, 0, 0.1],
            # Включение ускоренного режима для всех модулей
            [13, 17, 0, [0x000B, 0x0001, 0x01FF, 0x0000], 4, 1401, 1401, 0.0, 0.0],
            # Отключение ускоренного режима через 10 минут
            [13, 17, 0, [0x000B, 0x0000, 0x01FF, 0x0000], 4, 2001, 2001, 0.0, 0.0],
            # команда на старт сеанса съема информации
            [13, 17, 0, [0x0007, 0x0000, 0x0000, 0x0000], 4, 3601, 3600, 0.0, 1.0],
            # ЗУ БЭ
            [13, 18, 0, [0, 0, 0, 0], 4, 3610, 4500, 0.2, 0.0],
            [13, 14, 1, [0], 32, 3610, 4500, 0.2, 0.1],
            # установка измерительного интервала на 60 с
            [13, 17, 0, [0x03, 0, 0, 0], 4, 4510, 4510, 0, 0.0],
            # установка границ окон
            [13, 17, 0, [0x05, 1, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.0],
            [13, 17, 0, [0x05, 2, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.1],
            [13, 17, 0, [0x05, 3, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.2],
            [13, 17, 0, [0x05, 4, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.3],
            [13, 17, 0, [0x05, 5, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.4],
            [13, 17, 0, [0x05, 6, 0x0010, 0x3000], 4, 4510, 4510, 0, 0.5],
            # установка отсече МПП и границ окон
            [13, 17, 0, [0x06, 1, 10, 0], 4, 4510, 4510, 0, 1.0],
            [13, 17, 0, [0x06, 2, 10, 0], 4, 4510, 4510, 0, 1.1],
            [13, 17, 0, [0x06, 3, 10, 0], 4, 4510, 4510, 0, 1.2],
            [13, 17, 0, [0x06, 4, 10, 0], 4, 4510, 4510, 0, 1.3],
            [13, 17, 0, [0x06, 5, 10, 0], 4, 4510, 4510, 0, 1.4],
            [13, 17, 0, [0x06, 6, 10, 0], 4, 4510, 4510, 0, 1.5],
            # Блок опроса ЗУ МПП
            [13, 19, 0, [0, 1, 0, 0], 4, 4520, 5000, 2.0, 0.0],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 0.1],
            [13, 19, 0, [0, 2, 0, 0], 4, 4520, 5000, 2.0, 0.3],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 0.4],
            [13, 19, 0, [0, 3, 0, 0], 4, 4520, 5000, 2.0, 0.6],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 0.7],
            [13, 19, 0, [0, 4, 0, 0], 4, 4520, 5000, 2.0, 0.9],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 1.0],
            [13, 19, 0, [0, 5, 0, 0], 4, 4520, 5000, 2.0, 1.2],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 1.3],
            [13, 19, 0, [0, 6, 0, 0], 4, 4520, 5000, 2.0, 1.5],
            [13, 14, 1, [0], 32, 4520, 5000, 2.0, 1.6],
            # принудительное включение интервала измерения и формирования системного кадра на 10 с через ТП30
            [13, 30, 0, [0x3, 10, 10, 0], 4, 5002, 5002, 0, 0.0],
            # ЗУ БЭ
            [13, 18, 0, [0, 0, 0, 0], 4, 5003, 36000, 0.2, 0.0],
            [13, 14, 1, [0], 32, 5003, 36000, 0.2, 0.1],
            ]]

# проверка работы ЗУ МПП
mpp_mem_read = ["MPP memory read test SKE-LR", [
            # Инициализация СКЭ
            [13, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 1, 1, 0.0, 0.0],
            # Установка времени
            [13, 29, 0, [0x002E, 0x0000, 0x00AA, 0x0000], 4, 10, 10, 0, 0.0],
            # Блок опроса ЗУ МПП
            [13, 19, 0, [0, 1, 0, 0], 4, 600, 1200, 1.8, 0.0],
            [13, 14, 1, [0], 32, 600, 1200, 1.8, 0.1],
            [13, 19, 0, [0, 2, 0, 0], 4, 600, 1200, 1.8, 0.3],
            [13, 14, 1, [0], 32, 600, 1200, 1.8, 0.4],
            [13, 19, 0, [0, 3, 0, 0], 4, 600, 1200, 1.8, 0.6],
            [13, 14, 1, [0], 32, 600, 1200, 1.8, 0.7],
            [13, 19, 0, [0, 4, 0, 0], 4, 600, 1200, 1.8, 0.9],
            [13, 14, 1, [0], 32, 600, 1200, 1.8, 1.0],
            [13, 19, 0, [0, 5, 0, 0], 4, 600, 1200, 1.8, 1.2],
            [13, 14, 1, [0], 32, 600, 1200, 1.8, 1.3],
            [13, 19, 0, [0, 6, 0, 0], 4, 600, 1200, 1.8, 1.5],
            [13, 14, 1, [0], 32, 600, 1200, 1.8, 1.6],
            ]]

# проверка работы отключения питания
power_test = ["Power test SKE-LR", [
            # Инициализация СКЭ
            [13, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 0, 0, 0.0, 0.0],
            # Установка времени на 100 секунд
            [13, 29, 0, [0x002E, 0x0000, 10 + 100, 0x0000], 4, 25, 25, 0, 0.0],
            # принудительное включение интервала измерения и формирования системного кадра на 10 с через ТП30
            [13, 30, 0, [0x3, 10, 10, 0], 4, 25, 25, 0, 0.1],
            # Чтение оперативных данных один раз в 2 секунд в течение 30 минут
            [13, 15, 1, [0], 32, 30, 1800, 5, 0],
            [13, 1, 1, [0], 32, 30, 1800, 5, 0.1],
            [13, 2, 1, [0], 32, 30, 1800, 5, 0.2],
            [13, 3, 1, [0], 32, 30, 1800, 5, 0.3],
            [13, 4, 1, [0], 32, 30, 1800, 5, 0.4],
            [13, 5, 1, [0], 32, 30, 1800, 5, 0.5],
            [13, 6, 1, [0], 32, 30, 1800, 5, 0.6],
            [13, 7, 1, [0], 32, 30, 1800, 5, 0.7],
            [13, 8, 1, [0], 32, 30, 1800, 5, 0.8],
            [13, 9, 1, [0], 32, 30, 1800, 5, 0.9],
            # последовательное отключение модулей установкой уровня токовой защиты на небольшое значение
            [13, 17, 0, [0x9, 30, 180, 180], 4, 30, 30, 0, 0.0],
            [13, 17, 0, [0x9, 30, 30, 180], 4, 30, 30, 0, 20.0],
            [13, 17, 0, [0x9, 30, 30, 30], 4, 30, 30, 0, 40.0],
            # последовательное отключение токовой защиты заданием нулевых значений порогов
            [13, 17, 0, [0x9, 0, 0, 0], 4, 100, 100, 0, 0.0],
            # последовательное включение питания модулей
            [13, 17, 0, [0xA, 0x3, 0, 0], 4, 200, 200, 0, 0.0],
            [13, 17, 0, [0xA, 0x7, 0, 0], 4, 200, 200, 0, 20.0],
            [13, 17, 0, [0xA, 0xF, 0, 0], 4, 200, 200, 0, 40.0],
            ]]

# проверка работы ЗУ МПП
cm_mem_read = ["MPP memory read test SKE-LR", [
            # Инициализация СКЭ
            [13, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 1, 1, 0.0, 0.0],
            # Установка времени
            [13, 29, 0, [0x002E, 0x0000, 0x00AA, 0x0000], 4, 10, 10, 0, 0.0],
            # ЗУ БЭ
            [13, 18, 0, [0, 0, 0, 0], 4, 15, 3600, 0.2, 0.0],
            [13, 14, 1, [0], 32, 15, 3600, 0.2, 0.1],
            ]]

# быстрое чтение из ЗУ для проверки CRC_BAD
crc_bad_test = ["Проверка ошибок чтения", [
            # Инициализация СКЭ
            [13, 17, 0, [0x0002, 0x0000, 0x0000, 0x0000], 4, 1, 1, 0.0, 0.0],
            # принудительное включение интервала измерения и формирования системного кадра на 10 с через ТП30
            [13, 30, 0, [0x3, 10, 10, 0], 4, 19, 19, 0, 0.0],
            # Включение ускоренного режима для всех модулей
            [13, 17, 0, [0x000B, 0x0001, 0x01FF, 0x0000], 4, 20, 20, 0.0, 0.0],
            # команда на старт сеанса съема информации
            [13, 17, 0, [0x0007, 0x0000, 0x0000, 0x0000], 4, 1800, 1800, 0.0, 0.0],
            # ЗУ БЭ
            [13, 18, 0, [0, 0, 0, 0], 4, 1801, 15*3600, 0.11, 0.0],
            [13, 14, 1, [0], 32, 1801, 15*3600, 0.11, 0.1],
            ]]

